static/presentations/2018-04-25/index.org
#+REVEAL_THEME: white
#+TITLE:  IMR90 GRO-Seq
#+AUTHOR: Edmund Miller
#+OPTIONS: reveal_title_slide:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_HLEVEL: 2
* IMR90 GRO-Seq
* Reproducible Research
** Creating a Workflow
**
:PROPERTIES:
:reveal_background: img/Vimlogo.svg
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** Quick Commenting
*** Quick Commenting GIF
:PROPERTIES:
:reveal_background: img/vim-commentary.gif
:reveal_background_size: 1200px
:reveal_background_trans: slide
:END:
*** Moving Lines
*** Moving Lines GIF
:PROPERTIES:
:reveal_background: img/vim-move.gif
:reveal_background_size: 1200px
:reveal_background_trans: slide
:END:
*** Multiple Cursors
*** Multiple Cursors GIF
:PROPERTIES:
:reveal_background: img/vim-multiple-cursors.gif
:reveal_background_size: 1200px
:reveal_background_trans: slide
:END:
**
:PROPERTIES:
:reveal_background: img/emacs.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** Emacs
- Evil Keybinding
- Magit
- Dired
- Tramp
- Org-mode
*** Spacemacs
- Slow
- Difficult to Customize outside of the box
*** Doom Emacs
- Optimized
- Community
*** Org-Mode
- Slides
- TODOs
- Agenda
- Capture
- Lab-Notebook
- Babel
** Makefiles
***
:PROPERTIES:
:reveal_background: img/data.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
***
:PROPERTIES:
:reveal_background: img/data1.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
***
:PROPERTIES:
:reveal_background: img/data2.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
*** Example Makefile
#+BEGIN_SRC makefile
all: prot001.txt prot0002.txt prot003.txt

%.txt: ./bin/intensive_operation %.fasta
   $^ > $@

%.fasta:
    curl database.example.com/$* > $@
#+END_SRC
** Bioinformatics Pipelines
*** Toil
- Python 2.7
- UCSC
- Complex
*** Nextflow
- Java
- Barcelona Center for Genomic Regulation
- Push
- Able to script in any language
*** Snakemake
- Python 3.5
- Easy to containerize
- Pull
- Quick to use
- Largely used by the community
***
:PROPERTIES:
:reveal_background: img/snakemake.png
:reveal_background_size: 1000px
:reveal_background_trans: slide
:END:
*** Snakemake Example
#+BEGIN_SRC snakemake
rule targets:
    input:
        "plots/dataset1.pdf",
        "plots/dataset2.pdf"

rule plot:
    input:
        "raw/{dataset}.csv"
    output:
        "plots/{dataset}.pdf"
    shell:
        "somecommand {input} {output}"
#+END_SRC
*** Snakemake R
Requires ~rpy2~
#+BEGIN_SRC snakemake
rule mapRNAseq:
    input:
        file1 = "path/to/data/file1.bam",
        file2 = "path/to/data/file2.bam"
    output:
        "path/to/qlf_table.csv"
    run:
        R("""
        bamfiles <- cbind({input.file1},{input.file2})
        {output} <- featureCounts(bamfiles, annot.inbuilt="hg19", strandspecific=2)
        ...
        ...
        write.csv(qlf_table, file={output}, quote = FALSE)
        """)
#+END_SRC
***
:PROPERTIES:
:reveal_background: img/dropSeqPipeline.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
**
:PROPERTIES:
:reveal_background: img/docker.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
** Organizing Bioinformatics Projects
***
:PROPERTIES:
:reveal_background: img/org.png
:reveal_background_size: 1200px
:reveal_background_trans: slide
:END:
* Results
- Compared IMR90 Predicted Enhancers to GM
- Ran GREAT Analysis on them
- Began working to find coverage of eRNAs in Samples
** Compared IMR90 Predicted Enhancers to GM
*** Venn Diagram
#+BEGIN_SRC python
import pylab as plt
from matplotlib_venn import venn2
venn2(subsets = (6259, 10051, 1108), set_labels = ('IMR90', 'GM'))
plt.title("IMR90 vs GM eRNAs")
plt.show()
#+END_SRC
***
:PROPERTIES:
:reveal_background: img/Venn.png
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:
** GREAT IMR90 Unique
      - lung vasculature development
      - growth factor receptor binding
      - tissue remodeling
      - positive regulation of endothelial cell migration
      - embryonic skeletal joint development
** GREAT IMR90 and GM Overlap
      - 643(~30%) Transcripts were -500 to -50 from TSS
      - 1002(80%) Were Associated with 2 genes per region
      - 104(10%) were associated with 1 gene
      - Notable Biological processes:
        - cytokine secretion
        - cytokine production
        - regulation of immune response
        - immune effector process
        - regulation of transcription from RNA polymerase II promoter in response to stress
** Coverage of eRNAs in Samples
- Issue with lack of output
- Cause is most likely file types
** Snakemake IMR90
**
:PROPERTIES:
:reveal_background: img/dag.png
:reveal_background_size: 400px
:reveal_background_trans: slide
:END:
